{
    "1": "_<directive>_#include",
    "2": "_<include>_<stdio.h>",
    "3": "_<type>_int",
    "4": "_<id>_3@",
    "5": "_<op>_[",
    "6": "_<number>_#",
    "7": "_<op>_]",
    "8": "_<op>_=",
    "9": "_<op>_{",
    "10": "_<op>_}",
    "11": "_<op>_;",
    "12": "_<id>_2@",
    "13": "_<op>_,",
    "14": "_<id>_9@",
    "15": "_<id>_5@",
    "16": "_<id>_8@",
    "17": "_<op>_(",
    "18": "_<id>_1@",
    "19": "_<op>_)",
    "20": "_<id>_6@",
    "21": "_<keyword>_for",
    "22": "_<op>_<",
    "23": "_<op>_++",
    "24": "_<op>_+",
    "25": "_<keyword>_if",
    "26": "_<op>_>",
    "27": "_<id>_4@",
    "28": "_<keyword>_return",
    "29": "_<APIcall>_main",
    "30": "_<id>_7@",
    "31": "_<APIcall>_scanf",
    "32": "_<string>_",
    "33": "_<op>_&",
    "34": "_<APIcall>_printf",
    "35": "_<id>_10@",
    "36": "_<op>_&&",
    "37": "_<op>_-",
    "38": "_<insertion>_",
    "39": "_<keyword>_static",
    "40": "_<op>_--",
    "41": "_<op>_==",
    "42": "_<keyword>_while",
    "43": "_<keyword>_else",
    "44": "_<keyword>_continue",
    "45": "_<keyword>_break",
    "46": "_<op>_!",
    "47": "_<keyword>_void",
    "48": "_<include>_<limits.h>",
    "49": "_<id>_11@",
    "50": "_<id>_12@",
    "51": "_<id>_13@",
    "52": "_<op>_?",
    "53": "_<op>_:",
    "54": "_<include>_<stdlib.h>",
    "55": "_<id>_14@",
    "56": "_<directive>_#define",
    "57": "_<keyword>_do",
    "58": "_<id>_15@",
    "59": "_<op>_+=",
    "60": "_<include>_<string.h>",
    "61": "_<type>_char",
    "62": "_<APIcall>_strlen",
    "63": "_<op>_||",
    "64": "_<char>_",
    "65": "_<include>_<math.h>",
    "66": "_<type>_long",
    "67": "_<op>_#",
    "68": "_<op>_.",
    "69": "_<op>_*",
    "70": "_<keyword>_sizeof",
    "71": "_<op>_/",
    "72": "_<APIcall>_malloc",
    "73": "_<APIcall>_free",
    "74": "_<op>_%",
    "75": "_<type>_double",
    "76": "_<type>_float",
    "77": "_<type>_unsigned",
    "78": "_<op>_^",
    "79": "_<keyword>_signed",
    "80": "_<APIcall>_getchar",
    "81": "_<keyword>_EOF",
    "82": "_<keyword>_goto",
    "83": "_<char_continue>_",
    "84": "_<keyword>_const",
    "85": "_<op>_*=",
    "86": "_<op>_/=",
    "87": "_<id>_16@",
    "88": "_<id>_20@",
    "89": "_<id>_18@",
    "90": "_<id>_19@",
    "91": "_<id>_21@",
    "92": "_<id>_17@",
    "93": "_<op>_-=",
    "94": "_<include>_<strings.h>",
    "95": "_<keyword>_null",
    "96": "_<APIcall>_calloc",
    "97": "_<op>_**",
    "98": "_<keyword>_NULL",
    "99": "_<APIcall>_gets",
    "100": "_<op>_|",
    "101": "_<op>_|=",
    "102": "_<op>_%=",
    "103": "_<op>_<<",
    "104": "_<keyword>_switch",
    "105": "_<keyword>_case",
    "106": "_<keyword>_default",
    "107": "_<include>_<ctype.h>",
    "108": "_<op>_>>",
    "109": "_<type>_short",
    "110": "_<directive>_#include",
    "111": "_<include>_<stdio.h>",
    "112": "_<type>_int",
    "113": "_<id>_3@",
    "114": "_<op>_[",
    "115": "_<number>_#",
    "116": "_<op>_]",
    "117": "_<op>_=",
    "118": "_<op>_{",
    "119": "_<op>_}",
    "120": "_<op>_;",
    "121": "_<id>_2@",
    "122": "_<op>_,",
    "123": "_<id>_9@",
    "124": "_<id>_5@",
    "125": "_<id>_8@",
    "126": "_<op>_(",
    "127": "_<id>_1@",
    "128": "_<op>_)",
    "129": "_<id>_6@",
    "130": "_<keyword>_for",
    "131": "_<op>_<",
    "132": "_<op>_++",
    "133": "_<op>_+",
    "134": "_<keyword>_if",
    "135": "_<op>_>",
    "136": "_<id>_4@",
    "137": "_<keyword>_return",
    "138": "_<APIcall>_main",
    "139": "_<id>_7@",
    "140": "_<APIcall>_scanf",
    "141": "_<string>_",
    "142": "_<op>_&",
    "143": "_<APIcall>_printf",
    "144": "_<id>_10@",
    "145": "_<op>_&&",
    "146": "_<op>_-",
    "147": "_<insertion>_",
    "148": "_<keyword>_static",
    "149": "_<op>_--",
    "150": "_<op>_==",
    "151": "_<keyword>_while",
    "152": "_<keyword>_else",
    "153": "_<keyword>_continue",
    "154": "_<keyword>_break",
    "155": "_<op>_!",
    "156": "_<keyword>_void",
    "157": "_<include>_<limits.h>",
    "158": "_<id>_11@",
    "159": "_<id>_12@",
    "160": "_<id>_13@",
    "161": "_<op>_?",
    "162": "_<op>_:",
    "163": "_<include>_<stdlib.h>",
    "164": "_<id>_14@",
    "165": "_<directive>_#define",
    "166": "_<keyword>_do",
    "167": "_<id>_15@",
    "168": "_<op>_+=",
    "169": "_<include>_<string.h>",
    "170": "_<type>_char",
    "171": "_<APIcall>_strlen",
    "172": "_<op>_||",
    "173": "_<char>_",
    "174": "_<include>_<math.h>",
    "175": "_<type>_long",
    "176": "_<op>_#",
    "177": "_<op>_.",
    "178": "_<op>_*",
    "179": "_<keyword>_sizeof",
    "180": "_<op>_/",
    "181": "_<APIcall>_malloc",
    "182": "_<APIcall>_free",
    "183": "_<op>_%",
    "184": "_<type>_double",
    "185": "_<type>_float",
    "186": "_<type>_unsigned",
    "187": "_<op>_^",
    "188": "_<keyword>_signed",
    "189": "_<APIcall>_getchar",
    "190": "_<keyword>_EOF",
    "191": "_<keyword>_goto",
    "192": "_<char_continue>_",
    "193": "_<keyword>_const",
    "194": "_<op>_*=",
    "195": "_<op>_/=",
    "196": "_<id>_16@",
    "197": "_<id>_20@",
    "198": "_<id>_18@",
    "199": "_<id>_19@",
    "200": "_<id>_21@",
    "201": "_<id>_17@",
    "202": "_<op>_-=",
    "203": "_<include>_<strings.h>",
    "204": "_<keyword>_null",
    "205": "_<APIcall>_calloc",
    "206": "_<op>_**",
    "207": "_<keyword>_NULL",
    "208": "_<APIcall>_gets",
    "209": "_<op>_|",
    "210": "_<op>_|=",
    "211": "_<op>_%=",
    "212": "_<op>_<<",
    "213": "_<keyword>_switch",
    "214": "_<keyword>_case",
    "215": "_<keyword>_default",
    "216": "_<include>_<ctype.h>",
    "217": "_<op>_>>",
    "218": "_<type>_short"
}