{
    "1": "_<directive>_#include",
    "2": "_<include>_<stdio.h>",
    "3": "_<type>_int",
    "4": "_<id>_3@",
    "5": "_<op>_[",
    "6": "_<number>_#",
    "7": "_<op>_]",
    "8": "_<op>_=",
    "9": "_<op>_{",
    "10": "_<op>_}",
    "11": "_<op>_;",
    "12": "_<id>_2@",
    "13": "_<op>_,",
    "14": "_<id>_9@",
    "15": "_<id>_5@",
    "16": "_<id>_8@",
    "17": "_<op>_(",
    "18": "_<id>_1@",
    "19": "_<op>_)",
    "20": "_<id>_6@",
    "21": "_<keyword>_for",
    "22": "_<op>_<",
    "23": "_<op>_++",
    "24": "_<op>_+",
    "25": "_<keyword>_if",
    "26": "_<op>_>",
    "27": "_<id>_4@",
    "28": "_<keyword>_return",
    "29": "_<APIcall>_main",
    "30": "_<id>_7@",
    "31": "_<APIcall>_scanf",
    "32": "_<string>_",
    "33": "_<op>_&",
    "34": "_<APIcall>_printf",
    "35": "_<id>_10@",
    "36": "_<op>_&&",
    "37": "_<op>_-",
    "38": "_<insertion>_",
    "39": "_<keyword>_static",
    "40": "_<op>_--",
    "41": "_<op>_==",
    "42": "_<keyword>_while",
    "43": "_<keyword>_else",
    "44": "_<keyword>_continue",
    "45": "_<keyword>_break",
    "46": "_<op>_!",
    "47": "_<keyword>_void",
    "48": "_<include>_<limits.h>",
    "49": "_<id>_11@",
    "50": "_<id>_12@",
    "51": "_<id>_13@",
    "52": "_<op>_?",
    "53": "_<op>_:",
    "54": "_<include>_<stdlib.h>",
    "55": "_<id>_14@",
    "56": "_<directive>_#define",
    "57": "_<keyword>_do",
    "58": "_<id>_15@",
    "59": "_<op>_+=",
    "60": "_<include>_<string.h>",
    "61": "_<type>_char",
    "62": "_<APIcall>_strlen",
    "63": "_<op>_||",
    "64": "_<char>_",
    "65": "_<include>_<math.h>",
    "66": "_<type>_long",
    "67": "_<op>_#",
    "68": "_<op>_.",
    "69": "_<op>_*",
    "70": "_<keyword>_sizeof",
    "71": "_<op>_/",
    "72": "_<APIcall>_malloc",
    "73": "_<APIcall>_free",
    "74": "_<op>_%",
    "75": "_<type>_double",
    "76": "_<type>_float",
    "77": "_<type>_unsigned",
    "78": "_<op>_^",
    "79": "_<keyword>_signed",
    "80": "_<APIcall>_getchar",
    "81": "_<keyword>_EOF",
    "82": "_<keyword>_goto",
    "83": "_<char_continue>_",
    "84": "_<keyword>_const",
    "85": "_<op>_*=",
    "86": "_<op>_/=",
    "87": "_<id>_16@",
    "88": "_<id>_20@",
    "89": "_<id>_18@",
    "90": "_<id>_19@",
    "91": "_<id>_21@",
    "92": "_<id>_17@",
    "93": "_<op>_-=",
    "94": "_<include>_<strings.h>",
    "95": "_<keyword>_null",
    "96": "_<APIcall>_calloc",
    "97": "_<op>_**",
    "98": "_<keyword>_NULL",
    "99": "_<APIcall>_gets",
    "100": "_<op>_|",
    "101": "_<op>_|=",
    "102": "_<op>_%=",
    "103": "_<op>_<<",
    "104": "_<keyword>_switch",
    "105": "_<keyword>_case",
    "106": "_<keyword>_default",
    "107": "_<include>_<ctype.h>",
    "108": "_<op>_>>",
    "109": "_<type>_short",
    "110": "_<id>_@",
    "111": "_<directive>_#include",
    "112": "_<include>_<stdio.h>",
    "113": "_<type>_int",
    "114": "_<op>_[",
    "115": "_<number>_#",
    "116": "_<op>_]",
    "117": "_<op>_=",
    "118": "_<op>_{",
    "119": "_<op>_}",
    "120": "_<op>_;",
    "121": "_<op>_,",
    "122": "_<op>_(",
    "123": "_<op>_)",
    "124": "_<keyword>_for",
    "125": "_<op>_<",
    "126": "_<op>_++",
    "127": "_<op>_+",
    "128": "_<keyword>_if",
    "129": "_<op>_>",
    "130": "_<keyword>_return",
    "131": "_<APIcall>_main",
    "132": "_<APIcall>_scanf",
    "133": "_<string>_",
    "134": "_<op>_&",
    "135": "_<APIcall>_printf",
    "136": "_<op>_&&",
    "137": "_<op>_-",
    "138": "_<op>_.",
    "139": "_<keyword>_static",
    "140": "_<op>_--",
    "141": "_<op>_==",
    "142": "_<keyword>_while",
    "143": "_<keyword>_else",
    "144": "_<keyword>_continue",
    "145": "_<keyword>_break",
    "146": "_<op>_!",
    "147": "_<keyword>_void",
    "148": "_<include>_<limits.h>",
    "149": "_<op>_?",
    "150": "_<op>_:",
    "151": "_<include>_<stdlib.h>",
    "152": "_<directive>_#define",
    "153": "_<keyword>_do",
    "154": "_<op>_+=",
    "155": "_<include>_<string.h>",
    "156": "_<type>_char",
    "157": "_<APIcall>_strlen",
    "158": "_<op>_||",
    "159": "_<char>_",
    "160": "_<include>_<math.h>",
    "161": "_<type>_long",
    "162": "_<op>_#",
    "163": "_<op>_*",
    "164": "_<keyword>_sizeof",
    "165": "_<op>_/",
    "166": "_<APIcall>_malloc",
    "167": "_<APIcall>_free",
    "168": "_<op>_%",
    "169": "_<type>_double",
    "170": "_<type>_float",
    "171": "_<type>_unsigned",
    "172": "_<op>_^",
    "173": "_<keyword>_signed",
    "174": "_<APIcall>_getchar",
    "175": "_<keyword>_EOF",
    "176": "_<keyword>_goto",
    "177": "_<char_continue>_",
    "178": "_<keyword>_const",
    "179": "_<op>_*=",
    "180": "_<op>_/=",
    "181": "_<op>_-=",
    "182": "_<include>_<strings.h>",
    "183": "_<keyword>_null",
    "184": "_<APIcall>_calloc",
    "185": "_<op>_**",
    "186": "_<keyword>_NULL",
    "187": "_<APIcall>_gets",
    "188": "_<op>_|",
    "189": "_<op>_|=",
    "190": "_<op>_%=",
    "191": "_<op>_<<",
    "192": "_<keyword>_switch",
    "193": "_<keyword>_case",
    "194": "_<keyword>_default",
    "195": "_<include>_<ctype.h>",
    "196": "_<op>_>>",
    "197": "_<type>_short"
}