{
    "1": "_<directive>_#include",
    "2": "_<include>_<stdio.h>",
    "3": "_<type>_int",
    "4": "_<id>_3@",
    "5": "_<op>_[",
    "6": "_<number>_#",
    "7": "_<op>_]",
    "8": "_<op>_=",
    "9": "_<op>_{",
    "10": "_<op>_}",
    "11": "_<op>_;",
    "12": "_<id>_2@",
    "13": "_<op>_,",
    "14": "_<id>_9@",
    "15": "_<id>_5@",
    "16": "_<id>_8@",
    "17": "_<op>_(",
    "18": "_<id>_1@",
    "19": "_<op>_)",
    "20": "_<id>_6@",
    "21": "_<keyword>_for",
    "22": "_<op>_<",
    "23": "_<op>_++",
    "24": "_<op>_+",
    "25": "_<keyword>_if",
    "26": "_<op>_>",
    "27": "_<id>_4@",
    "28": "_<keyword>_return",
    "29": "_<APIcall>_main",
    "30": "_<id>_7@",
    "31": "_<APIcall>_scanf",
    "32": "_<string>_",
    "33": "_<op>_&",
    "34": "_<APIcall>_printf",
    "35": "-1",
    "36": "_<id>_10@",
    "37": "_<op>_&&",
    "38": "_<op>_-",
    "39": "_<insertion>_",
    "40": "_<keyword>_static",
    "41": "_<op>_--",
    "42": "_<op>_==",
    "43": "_<keyword>_while",
    "44": "_<keyword>_else",
    "45": "_<keyword>_continue",
    "46": "_<keyword>_break",
    "47": "_<op>_!",
    "48": "_<keyword>_void",
    "49": "_<include>_<limits.h>",
    "50": "_<id>_11@",
    "51": "_<id>_12@",
    "52": "_<id>_13@",
    "53": "_<op>_?",
    "54": "_<op>_:",
    "55": "_<include>_<stdlib.h>",
    "56": "_<id>_14@",
    "57": "_<directive>_#define",
    "58": "_<keyword>_do",
    "59": "_<id>_15@",
    "60": "_<op>_+=",
    "61": "_<include>_<string.h>",
    "62": "_<type>_char",
    "63": "_<APIcall>_strlen",
    "64": "_<op>_||",
    "65": "_<char>_",
    "66": "_<include>_<math.h>",
    "67": "_<type>_long",
    "68": "_<op>_#",
    "69": "_<op>_.",
    "70": "_<op>_*",
    "71": "_<keyword>_sizeof",
    "72": "_<op>_/",
    "73": "_<APIcall>_malloc",
    "74": "_<APIcall>_free",
    "75": "_<op>_%",
    "76": "_<type>_double",
    "77": "_<type>_float",
    "78": "_<type>_unsigned",
    "79": "_<op>_^",
    "80": "_<keyword>_signed",
    "81": "_<APIcall>_getchar",
    "82": "_<keyword>_EOF",
    "83": "_<keyword>_goto",
    "84": "_<char_continue>_",
    "85": "_<keyword>_const",
    "86": "_<op>_*=",
    "87": "_<op>_/=",
    "88": "_<id>_16@",
    "89": "_<id>_20@",
    "90": "_<id>_18@",
    "91": "_<id>_19@",
    "92": "_<id>_21@",
    "93": "_<id>_17@",
    "94": "_<op>_-=",
    "95": "_<include>_<strings.h>",
    "96": "_<keyword>_null",
    "97": "_<APIcall>_calloc",
    "98": "_<op>_**",
    "99": "_<keyword>_NULL",
    "100": "_<APIcall>_gets",
    "101": "_<op>_|",
    "102": "_<op>_|=",
    "103": "_<op>_%=",
    "104": "_<op>_<<",
    "105": "_<keyword>_switch",
    "106": "_<keyword>_case",
    "107": "_<keyword>_default",
    "108": "_<include>_<ctype.h>",
    "109": "_<op>_>>",
    "110": "_<id>_@",
    "111": "_<directive>_#include",
    "112": "_<include>_<stdio.h>",
    "113": "_<type>_int",
    "114": "_<op>_[",
    "115": "_<number>_#",
    "116": "_<op>_]",
    "117": "_<op>_=",
    "118": "_<op>_{",
    "119": "_<op>_}",
    "120": "_<op>_;",
    "121": "_<op>_,",
    "122": "_<op>_(",
    "123": "_<op>_)",
    "124": "_<keyword>_for",
    "125": "_<op>_<",
    "126": "_<op>_++",
    "127": "_<op>_+",
    "128": "_<keyword>_if",
    "129": "_<op>_>",
    "130": "_<keyword>_return",
    "131": "_<APIcall>_main",
    "132": "_<APIcall>_scanf",
    "133": "_<string>_",
    "134": "_<op>_&",
    "135": "_<APIcall>_printf",
    "136": "-1",
    "137": "_<op>_&&",
    "138": "_<op>_-",
    "139": "_<op>_.",
    "140": "_<keyword>_static",
    "141": "_<op>_--",
    "142": "_<op>_==",
    "143": "_<keyword>_while",
    "144": "_<keyword>_else",
    "145": "_<keyword>_continue",
    "146": "_<keyword>_break",
    "147": "_<op>_!",
    "148": "_<keyword>_void",
    "149": "_<include>_<limits.h>",
    "150": "_<op>_?",
    "151": "_<op>_:",
    "152": "_<include>_<stdlib.h>",
    "153": "_<directive>_#define",
    "154": "_<keyword>_do",
    "155": "_<op>_+=",
    "156": "_<include>_<string.h>",
    "157": "_<type>_char",
    "158": "_<APIcall>_strlen",
    "159": "_<op>_||",
    "160": "_<char>_",
    "161": "_<include>_<math.h>",
    "162": "_<type>_long",
    "163": "_<op>_#",
    "164": "_<op>_*",
    "165": "_<keyword>_sizeof",
    "166": "_<op>_/",
    "167": "_<APIcall>_malloc",
    "168": "_<APIcall>_free",
    "169": "_<op>_%",
    "170": "_<type>_double",
    "171": "_<type>_float",
    "172": "_<type>_unsigned",
    "173": "_<op>_^",
    "174": "_<keyword>_signed",
    "175": "_<APIcall>_getchar",
    "176": "_<keyword>_EOF",
    "177": "_<keyword>_goto",
    "178": "_<char_continue>_",
    "179": "_<keyword>_const",
    "180": "_<op>_*=",
    "181": "_<op>_/=",
    "182": "_<op>_-=",
    "183": "_<include>_<strings.h>",
    "184": "_<keyword>_null",
    "185": "_<APIcall>_calloc",
    "186": "_<op>_**",
    "187": "_<keyword>_NULL",
    "188": "_<APIcall>_gets",
    "189": "_<op>_|",
    "190": "_<op>_|=",
    "191": "_<op>_%=",
    "192": "_<op>_<<",
    "193": "_<keyword>_switch",
    "194": "_<keyword>_case",
    "195": "_<keyword>_default",
    "196": "_<include>_<ctype.h>",
    "197": "_<op>_>>",
    "198": "_<type>_short"
}